Revit 2027 API
RevitLinkType.GetChildIds Method
 Gets the ids of the immediate children of this link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetChildIds()
Public Function GetChildIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetChildIds()
member GetChildIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The element ids of all links which are linked directly into this one (immediate children)
Remarks
 This function only returns the ids of immediate children. Given the link structure A -> B -> C, then calling this function on A will only return B's id.
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace